name: "MSCNN"
layer {
  top: "data"
  top: "label_1_3x5"
  top: "label_1_5x7"
  top: "label_2_3x5"
  top: "label_2_5x7"
  top: "label_3_3x5"
  top: "label_3_5x7"
  top: "label_4_3x5"
  name: "data"
  type: "ImageGtData"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  image_gt_data_param {
    source: "../../../data/kitti/window_files/mscnn_window_file_kitti_ped_cyc_train.txt"
    batch_size: 4
    coord_num: 4
    resize_width: 1920
    resize_height: 576
    crop_width: 768
    crop_height: 576
    min_gt_height: 30
    downsample_rate: 8
    downsample_rate: 8
    downsample_rate: 16
    downsample_rate: 16
    downsample_rate: 32
    downsample_rate: 32
    downsample_rate: 64
    field_w: 40
    field_w: 56
    field_w: 80
    field_w: 112
    field_w: 160
    field_w: 224
    field_w: 360
    field_h: 60
    field_h: 84
    field_h: 120
    field_h: 168
    field_h: 240
    field_h: 336
    field_h: 480
    fg_threshold: 0.5
    do_multiple_scale: true
    min_scale: 60
    max_scale: 480
    shuffle: true
  }
}
layer {
  top: "data"
  top: "label_1_3x5"
  top: "label_1_5x7"
  top: "label_2_3x5"
  top: "label_2_5x7"
  top: "label_3_3x5"
  top: "label_3_5x7"
  top: "label_4_3x5"
  name: "data"
  type: "ImageGtData"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  image_gt_data_param {
    source: "../../../data/kitti/window_files/mscnn_window_file_kitti_ped_cyc_val.txt"
    batch_size: 2
    coord_num: 4
    resize_width: 1920
    resize_height: 576
    crop_width: 768
    crop_height: 576
    min_gt_height: 30
    downsample_rate: 8
    downsample_rate: 8
    downsample_rate: 16
    downsample_rate: 16
    downsample_rate: 32
    downsample_rate: 32
    downsample_rate: 64
    field_w: 40
    field_w: 56
    field_w: 80
    field_w: 112
    field_w: 160
    field_w: 224
    field_w: 360
    field_h: 60
    field_h: 84
    field_h: 120
    field_h: 168
    field_h: 240
    field_h: 336
    field_h: 480
    fg_threshold: 0.5
    do_multiple_scale: false
    shuffle: true
  }
}
layer {
  bottom: "data"
  top: "conv1_1"
  name: "conv1_1"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv1_1"
  top: "conv1_1"
  name: "relu1_1"
  type: "ReLU"
}
layer {
  bottom: "conv1_1"
  top: "conv1_2"
  name: "conv1_2"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv1_2"
  top: "conv1_2"
  name: "relu1_2"
  type: "ReLU"
}
layer {
  bottom: "conv1_2"
  top: "pool1"
  name: "pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool1"
  top: "conv2_1"
  name: "conv2_1"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv2_1"
  top: "conv2_1"
  name: "relu2_1"
  type: "ReLU"
}
layer {
  bottom: "conv2_1"
  top: "conv2_2"
  name: "conv2_2"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv2_2"
  top: "conv2_2"
  name: "relu2_2"
  type: "ReLU"
}
layer {
  bottom: "conv2_2"
  top: "pool2"
  name: "pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool2"
  top: "conv3_1"
  name: "conv3_1"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_1"
  top: "conv3_1"
  name: "relu3_1"
  type: "ReLU"
}
layer {
  bottom: "conv3_1"
  top: "conv3_2"
  name: "conv3_2"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_2"
  top: "conv3_2"
  name: "relu3_2"
  type: "ReLU"
}
layer {
  bottom: "conv3_2"
  top: "conv3_3"
  name: "conv3_3"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_3"
  top: "conv3_3"
  name: "relu3_3"
  type: "ReLU"
}
layer {
  bottom: "conv3_3"
  top: "pool3"
  name: "pool3"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool3"
  top: "conv4_1"
  name: "conv4_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_1"
  top: "conv4_1"
  name: "relu4_1"
  type: "ReLU"
}
layer {
  bottom: "conv4_1"
  top: "conv4_2"
  name: "conv4_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_2"
  top: "conv4_2"
  name: "relu4_2"
  type: "ReLU"
}
layer {
  bottom: "conv4_2"
  top: "conv4_3"
  name: "conv4_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_3"
  top: "conv4_3"
  name: "relu4_3"
  type: "ReLU"
}
layer {
  bottom: "conv4_3"
  top: "loss1_conv1"
  name: "loss1_conv1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "loss1_conv1"
  top: "loss1_conv1"
  name: "loss_relu1"
  type: "ReLU"
}
layer {
  bottom: "loss1_conv1"
  top: "LFCN_1_3x5"
  name: "LFCN_1_3x5"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 7
    pad_w: 1
    pad_h: 2
    kernel_w: 3
    kernel_h: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_1_3x5"
  bottom: "label_1_3x5"
  top: "loss_1_3x5"
  name: "detection_loss_1_3x5"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 3
    coord_num: 4
    lambda: 0.5
    field_h: 60
    field_w: 40
    field_whr: 2
    field_xyr: 2
    downsample_rate: 8
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "random"
    pos_neg_weighted: true
  }
  loss_weight: 0.9
}
layer {
  bottom: "LFCN_1_3x5"
  bottom: "label_1_3x5"
  top: "accuracy_1_3x5"
  top: "boxiou_1_3x5"
  name: "detection_accuracy_1_3x5"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 3
    coord_num: 4
    field_h: 60
    field_w: 40
    field_whr: 2
    field_xyr: 2
    downsample_rate: 8
  }
}
layer {
  bottom: "loss1_conv1"
  top: "LFCN_1_5x7"
  name: "LFCN_1_5x7"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 7
    pad_w: 2
    pad_h: 3
    kernel_w: 5
    kernel_h: 7
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_1_5x7"
  bottom: "label_1_5x7"
  top: "loss_1_5x7"
  name: "detection_loss_1_5x7"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 3
    coord_num: 4
    lambda: 0.5
    field_h: 84
    field_w: 56
    field_whr: 2
    field_xyr: 2
    downsample_rate: 8
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "random"
    pos_neg_weighted: true
  }
  loss_weight: 0.9
}
layer {
  bottom: "LFCN_1_5x7"
  bottom: "label_1_5x7"
  top: "accuracy_1_5x7"
  top: "boxiou_1_5x7"
  name: "detection_accuracy_1_5x7"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 3
    coord_num: 4
    field_h: 84
    field_w: 56
    field_whr: 2
    field_xyr: 2
    downsample_rate: 8
  }
}
layer {
  bottom: "conv4_3"
  top: "pool4"
  name: "pool4"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool4"
  top: "conv5_1"
  name: "conv5_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_1"
  top: "conv5_1"
  name: "relu5_1"
  type: "ReLU"
}
layer {
  bottom: "conv5_1"
  top: "conv5_2"
  name: "conv5_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_2"
  top: "conv5_2"
  name: "relu5_2"
  type: "ReLU"
}
layer {
  bottom: "conv5_2"
  top: "conv5_3"
  name: "conv5_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_3"
  top: "conv5_3"
  name: "relu5_3"
  type: "ReLU"
}
layer {
  bottom: "conv5_3"
  top: "LFCN_2_3x5"
  name: "LFCN_2_3x5"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 7
    pad_w: 1
    pad_h: 2
    kernel_w: 3
    kernel_h: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_2_3x5"
  bottom: "label_2_3x5"
  top: "loss_2_3x5"
  name: "detection_loss_2_3x5"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 3
    coord_num: 4
    lambda: 0.5
    field_h: 120
    field_w: 80
    field_whr: 2
    field_xyr: 2
    downsample_rate: 16
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "random"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_2_3x5"
  bottom: "label_2_3x5"
  top: "accuracy_2_3x5"
  top: "boxiou_2_3x5"
  name: "detection_accuracy_2_3x5"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 3
    coord_num: 4
    field_h: 120
    field_w: 80
    field_whr: 2
    field_xyr: 2
    downsample_rate: 16
  }
}
layer {
  bottom: "conv5_3"
  top: "LFCN_2_5x7"
  name: "LFCN_2_5x7"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 7
    pad_w: 2
    pad_h: 3
    kernel_w: 5
    kernel_h: 7
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_2_5x7"
  bottom: "label_2_5x7"
  top: "loss_2_5x7"
  name: "detection_loss_2_5x7"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 3
    coord_num: 4
    lambda: 0.5
    field_h: 168
    field_w: 112
    field_whr: 2
    field_xyr: 2
    downsample_rate: 16
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "random"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_2_5x7"
  bottom: "label_2_5x7"
  top: "accuracy_2_5x7"
  top: "boxiou_2_5x7"
  name: "detection_accuracy_2_5x7"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 3
    coord_num: 4
    field_h: 168
    field_w: 112
    field_whr: 2
    field_xyr: 2
    downsample_rate: 16
  }
}
layer {
  bottom: "conv5_3"
  top: "pool5"
  name: "pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool5"
  top: "conv6_1"
  name: "conv6_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }

}
layer {
  bottom: "conv6_1"
  top: "conv6_1"
  name: "relu6_1"
  type: "ReLU"
}
layer {
  bottom: "conv6_1"
  top: "LFCN_3_3x5"
  name: "LFCN_3_3x5"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 7
    pad_w: 1
    pad_h: 2
    kernel_w: 3
    kernel_h: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_3_3x5"
  bottom: "label_3_3x5"
  top: "loss_3_3x5"
  name: "detection_loss_3_3x5"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 3
    coord_num: 4
    lambda: 0.5
    field_h: 240
    field_w: 160
    field_whr: 2
    field_xyr: 2
    downsample_rate: 32
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "random"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_3_3x5"
  bottom: "label_3_3x5"
  top: "accuracy_3_3x5"
  top: "boxiou_3_3x5"
  name: "detection_accuracy_3_3x5"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 3
    coord_num: 4
    field_h: 240
    field_w: 160
    field_whr: 2
    field_xyr: 2
    downsample_rate: 32
  }
}
layer {
  bottom: "conv6_1"
  top: "LFCN_3_5x7"
  name: "LFCN_3_5x7"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 7
    pad_w: 2
    pad_h: 3
    kernel_w: 5
    kernel_h: 7
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_3_5x7"
  bottom: "label_3_5x7"
  top: "loss_3_5x7"
  name: "detection_loss_3_5x7"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 3
    coord_num: 4
    lambda: 0.5
    field_h: 336
    field_w: 224
    field_whr: 2
    field_xyr: 2
    downsample_rate: 32
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "random"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_3_5x7"
  bottom: "label_3_5x7"
  top: "accuracy_3_5x7"
  top: "boxiou_3_5x7"
  name: "detection_accuracy_3_5x7"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 3
    coord_num: 4
    field_h: 336
    field_w: 224
    field_whr: 2
    field_xyr: 2
    downsample_rate: 32
  }
}
layer {
  bottom: "conv6_1"
  top: "pool6"
  name: "pool6"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool6"
  top: "LFCN_4_3x5"
  name: "LFCN_4_3x5"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 7
    pad_w: 1
    pad_h: 2
    kernel_w: 3
    kernel_h: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "LFCN_4_3x5"
  bottom: "label_4_3x5"
  top: "loss_4_3x5"
  name: "detection_loss_4_3x5"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 3
    coord_num: 4
    lambda: 0.5
    field_h: 480
    field_w: 360
    field_whr: 2
    field_xyr: 2
    downsample_rate: 64
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "random"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_4_3x5"
  bottom: "label_4_3x5"
  top: "accuracy_4_3x5"
  top: "boxiou_4_3x5"
  name: "detection_accuracy_4_3x5"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 3
    coord_num: 4
    field_h: 480
    field_w: 360
    field_whr: 2
    field_xyr: 2
    downsample_rate: 64
  }
}
